import numpy as np

# 物理和数学常量
# 圆周率
pi = 3.14159265358979323846264338327950288419716939937510
deg2rad = pi / 180.0                              # 度到弧度转换因子
rad2deg = 1.0 / deg2rad                           # 弧度到度转换因子
rearth = 6.3712e6                                 # 地球半径 (米)
omega = 7.2921e-5                                # 地球自转角速度 (1/秒)

grav = 9.80665  # 重力加速度
H0 = 8432.95621 # 大气标高，按照平均温度为15摄氏度计算而来
p0 = 1000 # reference, units: hPa
R = 287
cp = 1004

# 时间常量 (以秒计)
hour = 3600.0
day = 24.0 * hour

# 误差阈值和缺省值
delt = 1.0e-8                                    # 判断浮点数近似相等的阈值
undef = np.nan                                     # 未定义或缺失值的标记
